apis/router/test/load.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable

  # target: 'https://staging.sushi.com'
  # target: 'http://127.0.0.1:4505'
  # target: 'http://127.0.0.1:4503'
  # target: 'http://127.0.0.1:4506'
  # target: 'http://127.0.0.1:4507'
  target: 'http://localhost:1338'
  # target: 'http://localhost:1339'
  # target: 'http://localhost:1340'
  # target: 'http://localhost:1341'
  # target: 'http://localhost:1342'

  http:
    # Responses have to be sent within 10 seconds, or an `ETIMEDOUT` error gets raised.
    timeout: 10
  phases:
    - name: Warm up the API
      duration: 120
      arrivalRate: 5000

  processor: "./processor.js"
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    # apdex: {}
    # metrics-by-endpoint: {}
  # apdex:
  #   threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 250
        - http.response_time.p95: 150
scenarios:
  - flow:
      # - get:
      #     url: "/200"
      #     expect:
      #       - statusCode: [200]
      - function: "setQuery"
      - get:
          url: "/swap/v1/1?chainId={{ query.chainId }}&tokenIn={{ query.tokenIn }}&tokenOut={{ query.tokenOut }}&amount={{ query.amount }}"
          headers:
            Keep-Alive: "timeout=5, max=1000"
          expect:
            - statusCode: [200, 503]